fall-cocktails/index.org
# ============================================================
# METADATA - Edit for each event
# ============================================================

#+HTML_HEAD: <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto+Slab">
#+HTML_HEAD: <link rel="stylesheet" href="css/base.css">
#+HTML_HEAD: <link rel="stylesheet" href="css/style.css">
#+HTML_HEAD: <script src="js/modernizr.js"></script>
#+HTML_HEAD: <meta property="og:title" content="Fall Cocktails" />
#+HTML_HEAD: <meta property="og:description" content="Join us for a very special evening.">
#+HTML_HEAD: <meta property="og:image" content="https://jaydixit.com/fall-cocktails/og.png"/>
#+HTML_HEAD: <meta property="og:url" content="index.html"/>

# ============================================================
# EVENT CONTENT - Edit these values for each new event
# ============================================================

# Parallax heading 1 (line 46 below): The Ascension of Fall
# Event title (line 90): Fall Cocktails
# Event body (lines 91-100): Main invitation text
# Event details (lines 102-104): Where/Map/When
# Parallax heading 2 (line 129): Until then!

# ============================================================
# HTML TEMPLATE
# ============================================================

#+BEGIN_EXPORT HTML
<style>
section.module.parallax-1 {
 background-image: url("img/1.jpg");
}
section.module.parallax-2 {
 background-image: url("img/2.png");
}
section.module.parallax-3 {
 background-image: url("img/3.png");
}

/* Dynamic parallax section heights */
section.module.parallax {
  min-height: 400px;
}

@media (min-width: 768px) {
  section.module.parallax {
    min-height: 500px;
  }
}

@media (min-width: 1200px) {
  section.module.parallax {
    min-height: 600px;
  }
}

/* Smooth scroll-triggered animations */
@keyframes fadeInUp {
  from {
    opacity: 0;
    transform: translateY(30px);
  }
  to {
    opacity: 1;
    transform: translateY(0);
  }
}

section.module.content {
  padding: 80px 24px;
  background: #fff;
  animation: fadeInUp 0.8s ease-out;
}

section.module.content .container {
  max-width: 700px;
  margin: 0 auto;
  padding: 48px;
}

section.module.content h1 {
  font-size: 2.5em;
  margin-bottom: 48px;
  text-align: center;
  font-weight: 300;
  letter-spacing: 0.02em;
}

section.module.content p {
  font-size: 1.2em;
  line-height: 1.75;
  margin-bottom: 24px;
  color: #333;
}

section.module.content .details {
  margin-top: 64px;
  padding: 40px;
  background: linear-gradient(135deg, #fafafa 0%, #f5f5f5 100%);
  border-radius: 12px;
  border: 1px solid #e8e8e8;
  box-shadow: 0 4px 12px rgba(0,0,0,0.06);
  transition: all 0.3s ease;
}

section.module.content .details:hover {
  box-shadow: 0 6px 20px rgba(0,0,0,0.1);
  transform: translateY(-2px);
}

section.module.content .details p {
  margin-bottom: 20px;
  font-size: 1.1em;
  line-height: 1.6;
}

section.module.content .details p:last-child {
  margin-bottom: 0;
}

section.module.content .details strong {
  display: inline-block;
  min-width: 90px;
  font-weight: 600;
  font-size: 1.05em;
  color: #9b4819;
  letter-spacing: 0.3px;
}

section.module.content .details a {
  color: #9b4819;
  text-decoration: none;
  transition: all 0.2s ease;
  border-bottom: 1px solid transparent;
}

section.module.content .details a:hover {
  color: #7a3614;
  border-bottom: 1px solid #9b4819;
}

@media (max-width: 768px) {
  section.module.content {
    padding: 64px 16px;
  }

  section.module.content .container {
    padding: 24px;
  }

  section.module.content h1 {
    font-size: 2em;
    margin-bottom: 32px;
  }

  section.module.content p {
    font-size: 1.1em;
    margin-bottom: 16px;
  }

  section.module.content .details {
    padding: 32px;
    margin-top: 48px;
  }

  section.module.content .details p {
    margin-bottom: 16px;
  }

  section.module.content .details strong {
    min-width: 80px;
    font-size: 1.02em;
  }
}
</style>

<div class="wrapper">

<section class="module parallax parallax-1">
    <div class="container">
     <h1>The Ascension of Fall</h1>
     <h1 class="bottom">⬇</h1>
    </div>
   </section>

#+END_EXPORT

#+BEGIN_EXPORT HTML
<section class="module content">
 <div class="container">
  <h1>Fall Cocktails</h1>

  <p>As we relinquish the memory of summer and embrace the cool caress of fall, I'm inviting friends to join me for cocktails at my apartment in Williamsburg this Friday (October 7) at 7:00pm.</p>

  <p>I'll be mixing eighteen (18) batches of Zapatero, a boozy concoction of mezcal, bourbon, and Aztec chocolate bitters. If I can source a bottle of Giffard banana liqueur, I may also attempt an ominous scotch cocktail called Les Fleurs du Mal. Your own civilian contributions of snacks, wine, and bottled spirits are also welcome, but let that notion be not an obligation but a glimmer of joyful possibility.</p>

  <p>If the air is warm and the night inviting, we may even ascend to the rooftop to admire the glittering skyline and raise a glass to the last gasp of summer.</p>

  <p>RSVP if you would, and of course please feel free to bring friends.</p>

  <p>Looking forward to seeing you. Until then!</p>

  <p>Jay</p>

  <div class="details">
   <p><strong>Where:</strong> <a href="https://goo.gl/maps/S7hov7YT44mbsjKD8">166 North 7th Street Apt. 3 Brooklyn NY 11211</a></p>
   <p><strong>Map:</strong> <a href="https://goo.gl/maps/S7hov7YT44mbsjKD8">https://goo.gl/maps/S7hov7YT44mbsjKD8</a></p>
   <p><strong>When:</strong> Friday October 7, 7:00pm</p>
  </div>

 </div>
</section>
#+END_EXPORT

#+BEGIN_EXPORT HTML

   <section class="module parallax parallax-2">
    <div class="container">
     <h1>Until then!</h1>
     <h1>⬇</h1>
    </div>
   </section>

   <section class="module parallax parallax-3">
    <div class="container">
    </div>
   </section>

 </main>

 <footer>
  <div class="container">
   <div class="copyright">
    <small>
     <a href="https://jaydixit.com">jaydixit.com</a>
    </small>
   </div>
  </div>
 </footer>

</div><!-- /#wrapper -->
#+END_EXPORT
